PX4/NuttX/arch/arm/src/stm32/hardware/stm32f427ax_pinmap.h
#define GPIO_FMC_INT3_0      (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN7)
#define GPIO_FMC_NCE3_0      (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN9)

#  define GPIO_FMC_CD_0      (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN9)
#  define GPIO_FMC_INT2_0    (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN6)
#  define GPIO_FMC_INTR_0    (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN10)
#  define GPIO_FMC_NCE2_0    (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN7)
#  define GPIO_FMC_NCE4_1    (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN10)
#  define GPIO_FMC_NCE4_2    (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN11)
#  define GPIO_FMC_NIORD_0   (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN6)
#  define GPIO_FMC_NIOWR_0   (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN8)
#  define GPIO_FMC_SDCKE0_1  (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN2)
#  define GPIO_FMC_SDCKE0_2  (GPIO_ALT|GPIO_AF12|GPIO_PORTC|GPIO_PIN3)
#  define GPIO_FMC_SDNE0_1   (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN3)
#  define GPIO_FMC_SDNE0_2   (GPIO_ALT|GPIO_AF12|GPIO_PORTC|GPIO_PIN2)
#  define GPIO_FMC_SDNWE_1   (GPIO_ALT|GPIO_AF12|GPIO_PORTC|GPIO_PIN0)
#  define GPIO_FMC_SDNWE_2   (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN5)
#  define GPIO_FMC_SDNRAS_0  (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN11)
#  define GPIO_FMC_SDCLK_0   (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN8)
#  define GPIO_FMC_SDNCAS_0  (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN15)
#  define GPIO_FMC_BA0_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN4)
#  define GPIO_FMC_BA1_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN5)
#  define GPIO_FMC_NREG_0    (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN7)

#  define GPIO_FMC_D16_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN8)
#  define GPIO_FMC_D17_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN9)
#  define GPIO_FMC_D18_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN10)
#  define GPIO_FMC_D19_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN11)
#  define GPIO_FMC_D20_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN12)
#  define GPIO_FMC_D21_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN13)
#  define GPIO_FMC_D22_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN14)
#  define GPIO_FMC_D23_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN15)
#  define GPIO_FMC_D24_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN0)
#  define GPIO_FMC_D25_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN1)
#  define GPIO_FMC_D26_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN2)
#  define GPIO_FMC_D27_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN3)
#  define GPIO_FMC_D28_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN6)
#  define GPIO_FMC_D29_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN7)
#  define GPIO_FMC_D30_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN9)
#  define GPIO_FMC_D31_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN10)
#  define GPIO_FMC_NBL2_0    (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN4)
#  define GPIO_FMC_NBL3_0    (GPIO_ALT|GPIO_AF12|GPIO_PORTI|GPIO_PIN5)
#  define GPIO_FMC_SDCKE0_3  (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN2)
#  define GPIO_FMC_SDCKE1_1  (GPIO_ALT|GPIO_AF12|GPIO_PORTB|GPIO_PIN5)
#  define GPIO_FMC_SDCKE1_2  (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN7)
#  define GPIO_FMC_SDNE0_3   (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN3)
#  define GPIO_FMC_SDNE1_1   (GPIO_ALT|GPIO_AF12|GPIO_PORTB|GPIO_PIN6)
#  define GPIO_FMC_SDNE1_2   (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN6)
#  define GPIO_FMC_SDNWE_3   (GPIO_ALT|GPIO_AF12|GPIO_PORTH|GPIO_PIN5)

/* Flexible Static Memory Controller (FSMC) */

#define GPIO_FSMC_A0_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN0)
#define GPIO_FSMC_A1_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN1)
#define GPIO_FSMC_A2_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN2)
#define GPIO_FSMC_A3_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN3)
#define GPIO_FSMC_A4_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN4)
#define GPIO_FSMC_A5_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN5)
#define GPIO_FSMC_A6_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN12)
#define GPIO_FSMC_A7_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN13)
#define GPIO_FSMC_A8_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN14)
#define GPIO_FSMC_A9_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTF|GPIO_PIN15)
#define GPIO_FSMC_A10_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN0)
#define GPIO_FSMC_A11_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN1)
#define GPIO_FSMC_A12_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN2)
#define GPIO_FSMC_A13_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN3)
#define GPIO_FSMC_A14_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN4)
#define GPIO_FSMC_A15_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN5)
#define GPIO_FSMC_A16_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN11)
#define GPIO_FSMC_A17_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN12)
#define GPIO_FSMC_A18_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN13)
#define GPIO_FSMC_A19_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN3)
#define GPIO_FSMC_A20_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN4)
#define GPIO_FSMC_A21_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN5)
#define GPIO_FSMC_A22_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN6)
#define GPIO_FSMC_A23_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN2)
#define GPIO_FSMC_A24_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN13)
#define GPIO_FSMC_A25_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN14)
#define GPIO_FSMC_NBL1_0      (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN1)
#define GPIO_FSMC_CLK_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN3)
#define GPIO_FSMC_D0_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN14)
#define GPIO_FSMC_D1_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN15)
#define GPIO_FSMC_D2_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN0)
#define GPIO_FSMC_D3_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN1)
#define GPIO_FSMC_D4_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN7)
#define GPIO_FSMC_D5_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN8)
#define GPIO_FSMC_D6_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN9)
#define GPIO_FSMC_D7_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN10)
#define GPIO_FSMC_D8_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN11)
#define GPIO_FSMC_D9_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN12)
#define GPIO_FSMC_D10_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN13)
#define GPIO_FSMC_D11_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN14)
#define GPIO_FSMC_D12_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN15)
#define GPIO_FSMC_D13_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN8)
#define GPIO_FSMC_D14_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN9)
#define GPIO_FSMC_D15_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN10)
#define GPIO_FSMC_NBL0_0      (GPIO_ALT|GPIO_AF12|GPIO_PORTE|GPIO_PIN0)
#define GPIO_FSMC_NE1_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN7)
#define GPIO_FSMC_NE2_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN9)
#define GPIO_FSMC_NE3_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN10)
#define GPIO_FSMC_NE4_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN12)
#define GPIO_FSMC_NL_0        (GPIO_ALT|GPIO_AF12|GPIO_PORTB|GPIO_PIN7)
#define GPIO_FSMC_NOE_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN4)
#define GPIO_FSMC_NWAIT_0     (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN6)
#define GPIO_FSMC_NWE_0       (GPIO_ALT|GPIO_AF12|GPIO_PORTD|GPIO_PIN5)

#define GPIO_FSMC_INT3_0      (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN7)
#define GPIO_FSMC_NCE3_0      (GPIO_ALT|GPIO_AF12|GPIO_PORTG|GPIO_PIN9)


/* I2C */

#define GPIO_I2C1_SCL_1       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN6)
#define GPIO_I2C1_SCL_2       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN8)
#define GPIO_I2C1_SDA_1       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN7)
#define GPIO_I2C1_SDA_2       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN9)
#define GPIO_I2C1_SMBA_0      (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN5)

#define GPIO_I2C2_SCL_1       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN10)
#define GPIO_I2C2_SCL_2       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTF|GPIO_PIN1)
#define GPIO_I2C2_SCL_3       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTH|GPIO_PIN4)
#define GPIO_I2C2_SDA_1       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTB|GPIO_PIN11)
#define GPIO_I2C2_SDA_2       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTF|GPIO_PIN0)
#define GPIO_I2C2_SDA_3       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTH|GPIO_PIN5)
#define GPIO_I2C2_SMBA_1      (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN12)
#define GPIO_I2C2_SMBA_2      (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN2)
#define GPIO_I2C2_SMBA_3      (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTH|GPIO_PIN6)

#define GPIO_I2C3_SCL_1       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTA|GPIO_PIN8)
#define GPIO_I2C3_SCL_2       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTH|GPIO_PIN7)
#define GPIO_I2C3_SDA_1       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTC|GPIO_PIN9)
#define GPIO_I2C3_SDA_2       (GPIO_ALT|GPIO_AF4|GPIO_OPENDRAIN|GPIO_PORTH|GPIO_PIN8)

#define GPIO_I2C3_SMBA_1      (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN9)
#define GPIO_I2C3_SMBA_2      (GPIO_ALT|GPIO_AF4|GPIO_PUSHPULL|GPIO_PORTH|GPIO_PIN9)


/* I2S */

#define GPIO_I2S2_CK_1        (GPIO_ALT|GPIO_AF5|GPIO_PORTB|GPIO_PIN10)
#define GPIO_I2S2_CK_2        (GPIO_ALT|GPIO_AF5|GPIO_PORTB|GPIO_PIN13)
#define GPIO_I2S2_CK_3        (GPIO_ALT|GPIO_AF5|GPIO_PORTI|GPIO_PIN1)
#define GPIO_I2S2_SD_1        (GPIO_ALT|GPIO_AF5|GPIO_PORTB|GPIO_PIN15)
#define GPIO_I2S2_SD_2        (GPIO_ALT|GPIO_AF5|GPIO_PORTC|GPIO_PIN3)
#define GPIO_I2S2_SD_3        (GPIO_ALT|GPIO_AF5|GPIO_PORTI|GPIO_PIN3)
#define GPIO_I2S2_WS_1        (GPIO_ALT|GPIO_AF5|GPIO_PORTB|GPIO_PIN12)
#define GPIO_I2S2_WS_2        (GPIO_ALT|GPIO_AF5|GPIO_PORTB|GPIO_PIN9)
#define GPIO_I2S2_WS_3        (GPIO_ALT|GPIO_AF5|GPIO_PORTI|GPIO_PIN0)

#  define GPIO_I2S2_CK_4      (GPIO_ALT|GPIO_AF5|GPIO_PORTD|GPIO_PIN3)
#  define GPIO_I2S2_SD_4      (GPIO_ALT|GPIO_AF5|GPIO_PORTC|GPIO_PIN1)


#  define GPIO_I2S2_MCK_0     (GPIO_ALT|GPIO_AF5|GPIO_PORTC|GPIO_PIN6)


#define GPIO_I2S2EXT_SD_1     (GPIO_ALT|GPIO_AF6|GPIO_PORTB|GPIO_PIN14)
#define GPIO_I2S2EXT_SD_2     (GPIO_ALT|GPIO_AF6|GPIO_PORTC|GPIO_PIN2)
#define GPIO_I2S2EXT_SD_3     (GPIO_ALT|GPIO_AF6|GPIO_PORTI|GPIO_PIN2)

#define GPIO_I2S3_CK_1        (GPIO_ALT|GPIO_AF6|GPIO_PORTB|GPIO_PIN3)
#define GPIO_I2S3_CK_2        (GPIO_ALT|GPIO_AF6|GPIO_PORTC|GPIO_PIN10)
#define GPIO_I2S3_MCK_0       (GPIO_ALT|GPIO_AF6|GPIO_PORTC|GPIO_PIN7)
#define GPIO_I2S3_SD_1        (GPIO_ALT|GPIO_AF6|GPIO_PORTB|GPIO_PIN5)
#define GPIO_I2S3_SD_2        (GPIO_ALT|GPIO_AF6|GPIO_PORTC|GPIO_PIN12)
#define GPIO_I2S3_WS_1        (GPIO_ALT|GPIO_AF6|GPIO_PORTA|GPIO_PIN4)
#define GPIO_I2S3_WS_2        (GPIO_ALT|GPIO_AF6|GPIO_PORTA|GPIO_PIN15)

#  define GPIO_I2S3_SD_3      (GPIO_ALT|GPIO_AF6|GPIO_PORTD|GPIO_PIN6)


#  define GPIO_I2S3EXT_SD_2   (GPIO_ALT|GPIO_AF7|GPIO_PORTB|GPIO_PIN4)

#define GPIO_I2S3EXT_SD_1     (GPIO_ALT|GPIO_AF6|GPIO_PORTC|GPIO_PIN11)

#define GPIO_I2S_CKIN_0       (GPIO_ALT|GPIO_AF5|GPIO_PORTC|GPIO_PIN9)

/* JTAG */

#define GPIO_JTCK_SWCLK_0     (GPIO_ALT|GPIO_AF0|GPIO_PORTA|GPIO_PIN14)
#define GPIO_JTDI_0           (GPIO_ALT|GPIO_AF0|GPIO_PORTA|GPIO_PIN15)
#define GPIO_JTDO_0           (GPIO_ALT|GPIO_AF0|GPIO_PORTB|GPIO_PIN3)
#define GPIO_JTMS_SWDIO_0     (GPIO_ALT|GPIO_AF0|GPIO_PORTA|GPIO_PIN13)
#define GPIO_JTRST_0          (GPIO_ALT|GPIO_AF0|GPIO_PORTB|GPIO_PIN4)

/* OTG FS/HS (VBUS PA9 is not an alternate configuration) */

#define GPIO_OTGFS_DM_0       (GPIO_ALT|GPIO_FLOAT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN11)
#define GPIO_OTGFS_DP_0       (GPIO_ALT|GPIO_FLOAT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN12)
#define GPIO_OTGFS_ID_0       (GPIO_ALT|GPIO_PULLUP|GPIO_AF10|GPIO_OPENDRAIN|GPIO_PORTA|GPIO_PIN10)
#define GPIO_OTGFS_SOF_0      (GPIO_ALT|GPIO_FLOAT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN8)

